org/articles/cybersec-projects.org
#+title:      CyberSec Projects
#+date:       [2026-05-08 Fri 17:23]
#+filetags:   :cybersecurity:hacking:it:project:
#+identifier: 20260508T172301
#+STARTUP: overview
#+TODO: TODO IN-PROGRESS DONE
#+TAGS: network(n) web(w) malware(m) crypto(c) defense(d) scripting(s) osint(o) re(r) ad(a) cloud(l)

