public_html/articles/cybersec-projects.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-09 Sat 15:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CyberSec Projects</title>
<meta name="author" content="Connal McInnis" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='../../style.css'/>
</head>
<body>
<div id="preamble" class="status">

<div class='nav-header'>
  <a href='../../index.html' class='back-link'>[← BACK TO HOME]</a>
  <div class='download-links'>
    DOWNLOAD: 
    <a href='../downloads/articles/cybersec-projects.org' download>ORG</a> | 
    <a href='../downloads/articles/cybersec-projects.md' download>MD</a> | 
    <a href='../downloads/articles/cybersec-projects.txt' download>TXT</a>
  </div>
</div>
</div>
<div id="content" class="content">
<h1 class="title">CyberSec Projects</h1>
