public_html/articles/cybersec-projects.html
<div id="outline-container-orga90ab8d" class="outline-3">
<h3 id="orga90ab8d"><span class="section-number-3">1.1.</span> ══════════════════════════════════════════</h3>
</div>
</div>
<div id="outline-container-orgcead959" class="outline-2">
<h2 id="orgcead959"><span class="section-number-2">2.</span> TIER 1 — WEEKEND PROJECTS (1–2 days each)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgdffb611" class="outline-3">
<h3 id="orgdffb611"><span class="section-number-3">2.1.</span> ══════════════════════════════════════════</h3>
</div>

<div id="outline-container-org50e8987" class="outline-3">
<h3 id="org50e8987"><span class="section-number-3">2.2.</span> <span class="todo TODO">TODO</span> [NET-W1] Set Up Kali Linux VM&nbsp;&nbsp;&nbsp<span class="tag"><span class="network">network</span></span></h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Install VirtualBox or VMware</li>
<li>Download Kali ISO, install, snapshot clean state</li>
<li>Learn basic terminal nav, update system</li>
<li>Install guest additions</li>
</ul>
<p>
<b>*</b> Combo: Base for every other project. Do first.
</p>
</div>
</div>
<div id="outline-container-orgd3d8e8c" class="outline-3">
<h3 id="orgd3d8e8c"><span class="section-number-3">2.3.</span> <span class="todo TODO">TODO</span> [NET-W2] Home Network Recon with Nmap&nbsp;&nbsp;&nbsp<span class="tag"><span class="network">network</span></span></h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Scan local subnet: <code>nmap -sn 192.168.x.0/24</code></li>
<li>Service scan: <code>nmap -sV -sC -A &lt;target&gt;</code></li>
<li>Output to XML, read it</li>
<li>Understand open ports on your own devices</li>
</ul>
<p>
<b>*</b> Combo: Feeds into Python scanner (SCRPT-W1) and SIEM setup (DEF-WK1)
</p>
</div>
</div>
<div id="outline-container-org9750034" class="outline-3">
<h3 id="org9750034"><span class="section-number-3">2.4.</span> <span class="todo TODO">TODO</span> [NET-W3] Wireshark Traffic Analysis&nbsp;&nbsp;&nbsp<span class="tag"><span class="network">network</span></span></h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Capture live traffic on home net</li>
<li>Filter HTTP, DNS, ARP</li>
<li>Find plaintext credentials in pcap (test pcap from online)</li>
<li>Export objects from HTTP stream</li>
</ul>
<p>
<b>*</b> Combo: Pairs with MitM week project (NET-WK4)
</p>
</div>
</div>
<div id="outline-container-orgb771ada" class="outline-3">
<h3 id="orgb771ada"><span class="section-number-3">2.5.</span> <span class="todo TODO">TODO</span> [NET-W4] Crack a WPA2 Handshake (Own Router)&nbsp;&nbsp;&nbsp<span class="tag"><span class="network">network</span></span></h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Use monitor mode + airodump-ng to capture 4-way handshake</li>
<li>Deauth a client to force reconnect</li>
<li>Crack with hashcat + rockyou.txt</li>
<li>Change your WiFi password after. Learn why WPA3 matters.</li>
</ul>
<p>
<b>*</b> NOTE: Own network only. Legal line clear.
</p>
</div>
</div>
<div id="outline-container-orgf27b01c" class="outline-3">
<h3 id="orgf27b01c"><span class="section-number-3">2.6.</span> <span class="todo TODO">TODO</span> [NET-W5] Netcat Fundamentals — Shells &amp; Transfers&nbsp;&nbsp;&nbsp<span class="tag"><span class="network">network</span></span></h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li>Open listeners, connect clients</li>
<li>Send files with nc</li>
<li>Reverse shell: <code>nc -e /bin/bash</code></li>
<li>Bind shell vs reverse shell — understand difference</li>
</ul>
<p>
<b>*</b> Combo: Foundation for all post-exploitation work
</p>
</div>
</div>
<div id="outline-container-org96d9682" class="outline-3">
<h3 id="org96d9682"><span class="section-number-3">2.7.</span> <span class="todo TODO">TODO</span> [WEB-W1] SQLi &amp; XSS on DVWA&nbsp;&nbsp;&nbsp<span class="tag"><span class="web">web</span></span></h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li>Install DVWA (Docker or XAMPP)</li>
<li>Complete SQLi: manual + sqlmap</li>
<li>Complete XSS: reflected, stored, DOM</li>
<li>Toggle security levels low→medium→high</li>
</ul>
<p>
<b>*</b> Combo: Directly builds into full OWASP week (WEB-WK1)
</p>
</div>
</div>
<div id="outline-container-org4d459b0" class="outline-3">
<h3 id="org4d459b0"><span class="section-number-3">2.8.</span> <span class="todo TODO">TODO</span> [WEB-W2] Burp Suite Interception Basics&nbsp;&nbsp;&nbsp<span class="tag"><span class="web">web</span></span></h3>
<div class="outline-text-3" id="text-2-8">
<ul class="org-ul">
<li>Set up browser proxy through Burp</li>
<li>Intercept, modify, replay requests</li>
<li>Use Repeater on DVWA login</li>
<li>Use Intruder for basic brute force</li>
</ul>
<p>
<b>*</b> Combo: Essential tool for all web projects
</p>
</div>
</div>
<div id="outline-container-org84dc287" class="outline-3">
<h3 id="org84dc287"><span class="section-number-3">2.9.</span> <span class="todo TODO">TODO</span> [WEB-W3] Command Injection &amp; File Inclusion on DVWA&nbsp;&nbsp;&nbsp<span class="tag"><span class="web">web</span></span></h3>
<div class="outline-text-3" id="text-2-9">
<ul class="org-ul">
<li>Command injection: OS commands through web input</li>
<li>LFI: read <code>/etc/passwd</code> via vulnerable param</li>
<li>RFI: include remote malicious file</li>
<li>CSRF: forge requests, steal sessions</li>
</ul>
</div>
</div>
<div id="outline-container-org07fa206" class="outline-3">
<h3 id="org07fa206"><span class="section-number-3">2.10.</span> <span class="todo TODO">TODO</span> [WEB-W4] Subdomain Enumeration &amp; Recon&nbsp;&nbsp;&nbsp<span class="tag"><span class="web">web</span>&nbsp;<span class="osint">osint</span></span></h3>
<div class="outline-text-3" id="text-2-10">
<ul class="org-ul">
<li>Use subfinder, amass on a target (HackerOne public programs)</li>
<li>Certificate transparency: crt.sh</li>
<li>Directory bruteforce with ffuf: <code>ffuf -w wordlist -u https://target/FUZZ</code></li>
<li>Document findings in structured notes</li>
</ul>
</div>
</div>
<div id="outline-container-orgff6ceef" class="outline-3">
<h3 id="orgff6ceef"><span class="section-number-3">2.11.</span> <span class="todo TODO">TODO</span> [OSINT-W1] Google Dorking &amp; Shodan Recon&nbsp;&nbsp;&nbsp<span class="tag"><span class="osint">osint</span></span></h3>
<div class="outline-text-3" id="text-2-11">
<ul class="org-ul">
<li>Learn 10 key Google dork operators</li>
<li>Find exposed login panels, open dirs, config files</li>
<li>Shodan: search for services by banner, CVE</li>
<li>Build a personal dork cheatsheet</li>
</ul>
</div>
</div>
<div id="outline-container-org9b759dd" class="outline-3">
<h3 id="org9b759dd"><span class="section-number-3">2.12.</span> <span class="todo TODO">TODO</span> [OSINT-W2] Email &amp; Username OSINT&nbsp;&nbsp;&nbsp<span class="tag"><span class="osint">osint</span></span></h3>
<div class="outline-text-3" id="text-2-12">
<ul class="org-ul">
<li>theHarvester: email harvest from domain</li>
<li>holehe or Sherlock: username across platforms</li>
<li>Have I Been Pwned API lookup</li>
<li>Build a target profile (use yourself as test subject)</li>
</ul>
</div>
</div>
