public_html/articles/cybersec-projects.html
<div id="outline-container-orge27925e" class="outline-3">
<h3 id="orge27925e"><span class="section-number-3">2.13.</span> <span class="todo TODO">TODO</span> [OSINT-W3] DNS Enumeration&nbsp;&nbsp;&nbsp<span class="tag"><span class="osint">osint</span>&nbsp;<span class="network">network</span></span></h3>
<div class="outline-text-3" id="text-2-13">
<ul class="org-ul">
<li>dnsrecon, dnsenum on practice domains</li>
<li>Zone transfer attempt</li>
<li>MX, TXT, NS record analysis</li>
<li>Reverse DNS lookup sweep</li>
</ul>
</div>
</div>
<div id="outline-container-org3fff843" class="outline-3">
<h3 id="org3fff843"><span class="section-number-3">2.14.</span> <span class="todo TODO">TODO</span> [SCRPT-W1] Python or Go Port Scanner&nbsp;&nbsp;&nbsp<span class="tag"><span class="scripting">scripting</span></span></h3>
<div class="outline-text-3" id="text-2-14">
<ul class="org-ul">
<li>Socket-based TCP port scanner</li>
<li>Add threading for speed</li>
<li>Service banner grabbing</li>
<li>Output to JSON/CSV</li>
</ul>
<p>
<b>*</b> Combo: Base for full recon tool (SCRPT-WK1)
</p>
</div>
</div>
<div id="outline-container-org880fdc1" class="outline-3">
<h3 id="org880fdc1"><span class="section-number-3">2.15.</span> <span class="todo TODO">TODO</span> [SCRPT-W2] Caesar Cipher → Basic Crypto in Python/go&nbsp;&nbsp;&nbsp<span class="tag"><span class="scripting">scripting</span>&nbsp;<span class="crypto">crypto</span></span></h3>
<div class="outline-text-3" id="text-2-15">
<ul class="org-ul">
<li>Implement Caesar, Vigenere, XOR cipher</li>
<li>Brute-force Caesar without key</li>
<li>Frequency analysis for Vigenere</li>
<li>Understand why these fail</li>
</ul>
</div>
</div>
<div id="outline-container-org41715e0" class="outline-3">
<h3 id="org41715e0"><span class="section-number-3">2.16.</span> <span class="todo TODO">TODO</span> [CRYPT-W1] Hash Cracking with Hashcat&nbsp;&nbsp;&nbsp<span class="tag"><span class="crypto">crypto</span></span></h3>
<div class="outline-text-3" id="text-2-16">
<ul class="org-ul">
<li>Identify hash types (hash-identifier, hashid)</li>
<li>Crack MD5, SHA1, bcrypt with rockyou.txt</li>
<li>Rules-based attack with hashcat rules</li>
<li>Dictionary vs brute vs combo attack modes</li>
</ul>
</div>
</div>
<div id="outline-container-org63ec02a" class="outline-3">
<h3 id="org63ec02a"><span class="section-number-3">2.17.</span> <span class="todo TODO">TODO</span> [CRYPT-W2] Steganography — Hide &amp; Find&nbsp;&nbsp;&nbsp<span class="tag"><span class="crypto">crypto</span></span></h3>
<div class="outline-text-3" id="text-2-17">
<ul class="org-ul">
<li>Hide text in image: steghide, LSB</li>
<li>Extract: steghide extract, stegsolve</li>
<li>Audio steganography: MP3Stego</li>
<li>Solve 3 stego CTF challenges</li>
</ul>
</div>
</div>
<div id="outline-container-org4072c9d" class="outline-3">
<h3 id="org4072c9d"><span class="section-number-3">2.18.</span> <span class="todo TODO">TODO</span> [DEF-W1] SSH Hardening + Key Auth&nbsp;&nbsp;&nbsp<span class="tag"><span class="defense">defense</span></span></h3>
<div class="outline-text-3" id="text-2-18">
<ul class="org-ul">
<li>Disable password auth, enable key-only</li>
<li>Change default port, restrict users</li>
<li>Set up fail2ban for SSH brute protection</li>
<li>Test hardening with nmap from Kali</li>
</ul>
</div>
</div>
<div id="outline-container-org1b0e0e4" class="outline-3">
<h3 id="org1b0e0e4"><span class="section-number-3">2.19.</span> <span class="todo TODO">TODO</span> [DEF-W2] Firewall Rules with UFW/iptables&nbsp;&nbsp;&nbsp<span class="tag"><span class="defense">defense</span></span></h3>
<div class="outline-text-3" id="text-2-19">
<ul class="org-ul">
<li>Default deny inbound policy</li>
<li>Allow only necessary ports</li>
<li>Log dropped packets</li>
<li>Test rules from external VM</li>
</ul>
</div>
</div>
<div id="outline-container-org5ea482c" class="outline-3">
<h3 id="org5ea482c"><span class="section-number-3">2.20.</span> <span class="todo TODO">TODO</span> [MAL-W1] Static Malware Analysis&nbsp;&nbsp;&nbsp<span class="tag"><span class="malware">malware</span></span></h3>
<div class="outline-text-3" id="text-2-20">
<ul class="org-ul">
<li>strings, file, xxd on a safe malware sample (MalwareBazaar)</li>
<li>Extract IPs/domains/registry keys from strings</li>
<li>PE header analysis with PEview or pestudio</li>
<li>Identify packing/obfuscation signs</li>
</ul>
</div>
</div>
<div id="outline-container-org4160ccc" class="outline-3">
<h3 id="org4160ccc"><span class="section-number-3">2.21.</span> <span class="todo TODO">TODO</span> [MAL-W2] Analyze a Malicious PCAP&nbsp;&nbsp;&nbsp<span class="tag"><span class="malware">malware</span>&nbsp;<span class="network">network</span></span></h3>
<div class="outline-text-3" id="text-2-21">
<ul class="org-ul">
<li>Download malware traffic pcap (malware-traffic-analysis.net)</li>
<li>Identify C2 beaconing patterns</li>
<li>Extract indicators of compromise (IOCs)</li>
<li>Write a short analysis report</li>
</ul>
</div>
</div>
<div id="outline-container-org43e7e0f" class="outline-3">
<h3 id="org43e7e0f"><span class="section-number-3">2.22.</span> <span class="todo TODO">TODO</span> [RE-W1] Linux Privilege Escalation Basics&nbsp;&nbsp;&nbsp<span class="tag"><span class="re">re</span></span></h3>
<div class="outline-text-3" id="text-2-22">
<ul class="org-ul">
<li>GTFOBins: SUID binary abuse</li>
<li>Writable /etc/passwd, cron abuse</li>
<li>sudo -l misconfigs</li>
<li>linPEAS on a VulnHub machine</li>
</ul>
</div>
</div>
<div id="outline-container-org3ef184b" class="outline-3">
<h3 id="org3ef184b"><span class="section-number-3">2.23.</span> <span class="todo TODO">TODO</span> [DEF-W3] GPG Encryption — Files &amp; Email&nbsp;&nbsp;&nbsp<span class="tag"><span class="defense">defense</span>&nbsp;<span class="crypto">crypto</span></span></h3>
<div class="outline-text-3" id="text-2-23">
<ul class="org-ul">
<li>Generate GPG keypair</li>
<li>Encrypt/decrypt files</li>
<li>Sign and verify</li>
<li>Export/import public keys</li>
</ul>
</div>
</div>
<div id="outline-container-orgbafc271" class="outline-3">
<h3 id="orgbafc271"><span class="section-number-3">2.24.</span> <span class="todo TODO">TODO</span> [NET-W6] Set Up WireGuard VPN&nbsp;&nbsp;&nbsp<span class="tag"><span class="network">network</span>&nbsp;<span class="defense">defense</span></span></h3>
<div class="outline-text-3" id="text-2-24">
<ul class="org-ul">
<li>Install WireGuard on a VPS or local VM</li>
<li>Generate peer keys, configure tunnels</li>
<li>Route traffic through tunnel</li>
<li>Verify with Wireshark — confirm encryption</li>
</ul>
</div>
</div>
<div id="outline-container-orgd689412" class="outline-3">
<h3 id="orgd689412"><span class="section-number-3">2.25.</span> <span class="todo TODO">TODO</span> [OSINT-W4] Digital Forensics — File Recovery&nbsp;&nbsp;&nbsp<span class="tag"><span class="osint">osint</span></span></h3>
<div class="outline-text-3" id="text-2-25">
<ul class="org-ul">
<li>Create a disk image with dd</li>
<li>Recover deleted files with autopsy + foremost</li>
<li>Analyze file metadata (exiftool)</li>
<li>Build a basic forensics checklist</li>
</ul>
</div>
</div>
<div id="outline-container-org0aa273a" class="outline-3">
<h3 id="org0aa273a"><span class="section-number-3">2.26.</span> <span class="todo TODO">TODO</span> [WEB-W5] JWT Attack Lab&nbsp;&nbsp;&nbsp<span class="tag"><span class="web">web</span></span></h3>
<div class="outline-text-3" id="text-2-26">
<ul class="org-ul">
<li>Decode JWT (jwt.io)</li>
<li>none algorithm attack</li>
<li>Brute force weak HS256 secret (hashcat)</li>
<li>Key confusion attack (RS256→HS256)</li>
</ul>
</div>
</div>
