public_html/articles/cybersec-projects.html
<div id="outline-container-org2ba0fa1" class="outline-3">
<h3 id="org2ba0fa1"><span class="section-number-3">2.27.</span> <span class="todo TODO">TODO</span> [CTF-W1] Complete 5 picoCTF Beginner Challenges&nbsp;&nbsp;&nbsp<span class="tag"><span class="web">web</span>&nbsp;<span class="crypto">crypto</span>&nbsp;<span class="re">re</span></span></h3>
<div class="outline-text-3" id="text-2-27">
<ul class="org-ul">
<li>Pick challenges across: crypto, forensics, web, general skills</li>
<li>Document solve methodology for each</li>
<li>Learn to use CyberChef</li>
<li>Join a CTF Discord for hints</li>
</ul>
</div>
</div>
<div id="outline-container-orgfb7c58e" class="outline-3">
<h3 id="orgfb7c58e"><span class="section-number-3">2.28.</span> <span class="todo TODO">TODO</span> [SCRPT-W3] Log Parser in Python&nbsp;&nbsp;&nbsp<span class="tag"><span class="scripting">scripting</span>&nbsp;<span class="defense">defense</span></span></h3>
<div class="outline-text-3" id="text-2-28">
<ul class="org-ul">
<li>Parse /var/log/auth.log for failed logins</li>
<li>Count IPs, flag threshold breaches</li>
<li>Output alert summary</li>
<li>Extend to syslog, apache access logs</li>
</ul>
</div>
</div>
<div id="outline-container-org2b4d903" class="outline-3">
<h3 id="org2b4d903"><span class="section-number-3">2.29.</span> <span class="todo TODO">TODO</span> [NET-W7] Proxy Chains + Tor Setup&nbsp;&nbsp;&nbsp<span class="tag"><span class="network">network</span></span></h3>
<div class="outline-text-3" id="text-2-29">
<ul class="org-ul">
<li>Install tor + proxychains</li>
<li>Route nmap through proxychains</li>
<li>Understand Tor limitations for pentesting</li>
<li>Test anonymity with whatismyip</li>
</ul>
</div>
</div>
<div id="outline-container-orgccec6d7" class="outline-3">
<h3 id="orgccec6d7"><span class="section-number-3">2.30.</span> <span class="todo TODO">TODO</span> [WEB-W6] HTTP Security Headers Audit Tool&nbsp;&nbsp;&nbsp<span class="tag"><span class="web">web</span>&nbsp;<span class="scripting">scripting</span></span></h3>
<div class="outline-text-3" id="text-2-30">
<ul class="org-ul">
<li>Python script: fetch headers from any URL</li>
<li>Check: CSP, HSTS, X-Frame-Options, CORS</li>
<li>Score and report missing headers</li>
<li>Run against 10 real sites (ethically)</li>
</ul>
</div>
</div>
<div id="outline-container-org2426d00" class="outline-3">
<h3 id="org2426d00"><span class="section-number-3">2.31.</span> <span class="todo TODO">TODO</span> [DEF-W4] Set Up Basic Honeypot (Cowrie)&nbsp;&nbsp;&nbsp<span class="tag"><span class="defense">defense</span></span></h3>
<div class="outline-text-3" id="text-2-31">
<ul class="org-ul">
<li>Install Cowrie SSH honeypot</li>
<li>Expose on a VPS or local VM</li>
<li>Watch logs for hit attempts</li>
<li>Extract attacker IPs and commands</li>
</ul>
</div>
</div>
<div id="outline-container-orgb1ed490" class="outline-3">
<h3 id="orgb1ed490"><span class="section-number-3">2.32.</span> <span class="todo TODO">TODO</span> [RE-W2] Reverse a Simple Crackme Binary&nbsp;&nbsp;&nbsp<span class="tag"><span class="re">re</span></span></h3>
<div class="outline-text-3" id="text-2-32">
<ul class="org-ul">
<li>Download crackme from crackmes.one (easy level)</li>
<li>Use ltrace/strace first</li>
<li>Open in Ghidra — find password check logic</li>
<li>Patch binary to bypass check</li>
</ul>
</div>
</div>
<div id="outline-container-org8ee6431" class="outline-3">
<h3 id="org8ee6431"><span class="section-number-3">2.33.</span> <span class="todo TODO">TODO</span> [AD-W1] Active Directory Concepts + Lab Setup&nbsp;&nbsp;&nbsp<span class="tag"><span class="ad">ad</span></span></h3>
<div class="outline-text-3" id="text-2-33">
<ul class="org-ul">
<li>Install Windows Server eval VM</li>
<li>Promote to domain controller</li>
<li>Create OUs, users, groups</li>
<li>Join a Windows 10 VM to the domain</li>
</ul>
</div>
</div>
<div id="outline-container-orgb78f1e9" class="outline-3">
<h3 id="orgb78f1e9"><span class="section-number-3">2.34.</span> <span class="todo TODO">TODO</span> [CLOUD-W1] AWS Free Tier — IAM Misconfig Hunt&nbsp;&nbsp;&nbsp<span class="tag"><span class="cloud">cloud</span></span></h3>
<div class="outline-text-3" id="text-2-34">
<ul class="org-ul">
<li>Create AWS free tier account</li>
<li>Create intentionally misconfigured IAM (for lab)</li>
<li>Use ScoutSuite or Prowler to audit</li>
<li>Enumerate with AWS CLI using overprivileged user</li>
</ul>
</div>
</div>
<div id="outline-container-org4a81cff" class="outline-3">
<h3 id="org4a81cff"><span class="section-number-3">2.35.</span> <span class="todo TODO">TODO</span> [SCRPT-W4] Build HTTP Header Fuzzer&nbsp;&nbsp;&nbsp<span class="tag"><span class="scripting">scripting</span>&nbsp;<span class="web">web</span></span></h3>
<div class="outline-text-3" id="text-2-35">
<ul class="org-ul">
<li>Python requests — iterate custom headers</li>
<li>Fuzz Host, X-Forwarded-For, Content-Type</li>
<li>Look for 500 errors or behavioral changes</li>
<li>Test on DVWA or local lab app</li>
</ul>
</div>
</div>
<div id="outline-container-org6f289e3" class="outline-3">
<h3 id="org6f289e3"><span class="section-number-3">2.36.</span> <span class="todo TODO">TODO</span> [NET-W8] TryHackMe — Complete 2 Beginner Rooms&nbsp;&nbsp;&nbsp<span class="tag"><span class="network">network</span></span></h3>
<div class="outline-text-3" id="text-2-36">
<ul class="org-ul">
<li>Recommended: &ldquo;Basic Pentesting&rdquo;, &ldquo;Startup&rdquo;</li>
<li>Document methodology: recon → exploit → flags</li>
<li>Note tools used and commands</li>
<li>Subscribe to free tier</li>
</ul>
</div>
</div>
<div id="outline-container-org81fd093" class="outline-3">
<h3 id="org81fd093"><span class="section-number-3">2.37.</span> ══════════════════════════════════════════</h3>
</div>
</div>
<div id="outline-container-org7ab9bc1" class="outline-2">
<h2 id="org7ab9bc1"><span class="section-number-2">3.</span> TIER 2 — WEEK PROJECTS (3–7 days each)</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5d268cd" class="outline-3">
<h3 id="org5d268cd"><span class="section-number-3">3.1.</span> ══════════════════════════════════════════</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org95786b5" class="outline-4">
<h4 id="org95786b5"><span class="section-number-4">3.1.1.</span> <span class="todo TODO">TODO</span> [SCRPT-WK1] Full Go or Python Recon Framework&nbsp;&nbsp;&nbsp<span class="tag"><span class="scripting">scripting</span>&nbsp;<span class="network">network</span>&nbsp;<span class="osint">osint</span></span></h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>Combine: port scanner + subdomain enum + DNS recon + header check</li>
<li>Single CLI tool with argparse</li>
<li>Output to JSON report + markdown summary</li>
<li>Add screenshot capability (selenium headless)</li>
</ul>
<p>
<b>*</b> Combo: Ports directly into full pentest suite (SCRPT-MO1)
</p>
</div>
</div>
<div id="outline-container-orgd0ee682" class="outline-4">
<h4 id="orgd0ee682"><span class="section-number-4">3.1.2.</span> <span class="todo TODO">TODO</span> [NET-WK1] Full Pentest: VulnHub Beginner Machine&nbsp;&nbsp;&nbsp<span class="tag"><span class="network">network</span>&nbsp;<span class="web">web</span>&nbsp;<span class="re">re</span></span></h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>Download: Mr-Robot, Kioptrix, or Basic Pentesting 1</li>
<li>Recon → foothold → privesc → root</li>
<li>Document every step in markdown</li>
<li>Write a mini pentest report</li>
</ul>
<p>
<b>*</b> Combo: Chain 3+ machines → OSCP prep (NET-MO1)
</p>
</div>
</div>
