public_html/articles/cybersec-projects.html
<div id="outline-container-orgecb4eff" class="outline-4">
<h4 id="orgecb4eff"><span class="section-number-4">3.1.3.</span> <span class="todo TODO">TODO</span> [WEB-WK1] Complete OWASP Top 10 on WebGoat&nbsp;&nbsp;&nbsp<span class="tag"><span class="web">web</span></span></h4>
<div class="outline-text-4" id="text-3-1-3">
<ul class="org-ul">
<li>Install WebGoat (Java or Docker)</li>
<li>Complete all OWASP Top 10 lessons</li>
<li>A01 Broken Access Control through A10 SSRF</li>
<li>Write one-pager summary per vuln</li>
</ul>
<p>
<b>*</b> Combo: Unlocks web pentest automation month project
</p>
</div>
</div>
<div id="outline-container-orgb77b07f" class="outline-4">
<h4 id="orgb77b07f"><span class="section-number-4">3.1.4.</span> <span class="todo TODO">TODO</span> [NET-WK2] Man-in-the-Middle Attack Lab&nbsp;&nbsp;&nbsp<span class="tag"><span class="network">network</span></span></h4>
<div class="outline-text-4" id="text-3-1-4">
<ul class="org-ul">
<li>ARP spoofing: arpspoof + Wireshark in isolated VM lab</li>
<li>SSL stripping with bettercap</li>
<li>Capture credentials from HTTP traffic</li>
<li>Defend: static ARP + HTTPS enforcement</li>
</ul>
</div>
</div>
<div id="outline-container-orgdeb25eb" class="outline-4">
<h4 id="orgdeb25eb"><span class="section-number-4">3.1.5.</span> <span class="todo TODO">TODO</span> [DEF-WK1] Set Up ELK Stack SIEM&nbsp;&nbsp;&nbsp<span class="tag"><span class="defense">defense</span></span></h4>
<div class="outline-text-4" id="text-3-1-5">
<ul class="org-ul">
<li>Install Elasticsearch + Logstash + Kibana (Docker)</li>
<li>Ship syslog, auth.log, firewall logs via Filebeat</li>
<li>Build 3 dashboards: failed logins, port scans, outbound traffic</li>
<li>Write 2 detection rules</li>
</ul>
<p>
<b>*</b> Combo: Core of home SOC (DEF-MO1)
</p>
</div>
</div>
<div id="outline-container-org4d2c3f4" class="outline-4">
<h4 id="org4d2c3f4"><span class="section-number-4">3.1.6.</span> <span class="todo TODO">TODO</span> [DEF-WK2] Honeypot + Log Pipeline&nbsp;&nbsp;&nbsp<span class="tag"><span class="defense">defense</span></span></h4>
<div class="outline-text-4" id="text-3-1-6">
<ul class="org-ul">
<li>Ship Cowrie logs into ELK</li>
<li>Dashboard: attacker IPs, commands run, passwords tried</li>
<li>Cross-reference IPs with threat intel feeds (AbuseIPDB API)</li>
<li>Alert on new attacker commands</li>
</ul>
</div>
</div>
<div id="outline-container-org7f7e496" class="outline-4">
<h4 id="org7f7e496"><span class="section-number-4">3.1.7.</span> <span class="todo TODO">TODO</span> [MAL-WK1] Dynamic Malware Analysis in Sandbox&nbsp;&nbsp;&nbsp<span class="tag"><span class="malware">malware</span></span></h4>
<div class="outline-text-4" id="text-3-1-7">
<ul class="org-ul">
<li>Set up FlareVM or REMnux</li>
<li>Run safe malware sample in isolated VM</li>
<li>Monitor: procmon, Wireshark, regshot</li>
<li>Document: file drops, registry changes, network IOCs</li>
</ul>
</div>
</div>
<div id="outline-container-orga8ff92c" class="outline-4">
<h4 id="orga8ff92c"><span class="section-number-4">3.1.8.</span> <span class="todo TODO">TODO</span> [MAL-WK2] Reverse Engineering with Ghidra&nbsp;&nbsp;&nbsp<span class="tag"><span class="malware">malware</span>&nbsp;<span class="re">re</span></span></h4>
<div class="outline-text-4" id="text-3-1-8">
<ul class="org-ul">
<li>Install Ghidra</li>
<li>Decompile a simple CTF binary — find hardcoded key</li>
<li>Decompile crackme — patch jump condition</li>
<li>Analyze a real open-source malware (TinyShell)</li>
<li>Annotate functions in Ghidra</li>
</ul>
</div>
</div>
<div id="outline-container-org935c3ae" class="outline-4">
<h4 id="org935c3ae"><span class="section-number-4">3.1.9.</span> <span class="todo TODO">TODO</span> [NET-WK3] Network Pivoting Lab&nbsp;&nbsp;&nbsp<span class="tag"><span class="network">network</span></span></h4>
<div class="outline-text-4" id="text-3-1-9">
<ul class="org-ul">
<li>3-VM lab: attacker | pivot | inner target</li>
<li>Compromise pivot, use it to reach inner</li>
<li>SSH tunneling: local/remote/dynamic port forward</li>
<li>Metasploit route + socks proxy</li>
</ul>
<p>
<b>*</b> Combo: Essential for AD month project
</p>
</div>
</div>
<div id="outline-container-org139f392" class="outline-4">
<h4 id="org139f392"><span class="section-number-4">3.1.10.</span> <span class="todo TODO">TODO</span> [CRYPT-WK1] Implement Crypto Attacks in Python&nbsp;&nbsp;&nbsp<span class="tag"><span class="crypto">crypto</span>&nbsp;<span class="scripting">scripting</span></span></h4>
<div class="outline-text-4" id="text-3-1-10">
<ul class="org-ul">
<li>Padding oracle attack (against vulnerable Flask app you write)</li>
<li>Length extension attack on SHA1</li>
<li>ECB mode block detection (CBC vs ECB oracle)</li>
<li>RSA small e attack (cube root)</li>
</ul>
</div>
</div>
<div id="outline-container-org5657ca1" class="outline-4">
<h4 id="org5657ca1"><span class="section-number-4">3.1.11.</span> <span class="todo TODO">TODO</span> [WEB-WK2] SQLi Scanner + SSRF + XXE Lab&nbsp;&nbsp;&nbsp<span class="tag"><span class="web">web</span>&nbsp;<span class="scripting">scripting</span></span></h4>
<div class="outline-text-4" id="text-3-1-11">
<ul class="org-ul">
<li>Write Python SQLi error-based scanner</li>
<li>SSRF: reach internal metadata endpoint (cloud lab)</li>
<li>XXE: read /etc/passwd via XML input</li>
<li>Test all three on deliberately vulnerable apps</li>
</ul>
</div>
</div>
<div id="outline-container-org8212730" class="outline-4">
<h4 id="org8212730"><span class="section-number-4">3.1.12.</span> <span class="todo TODO">TODO</span> [AD-WK1] Active Directory Attack Lab&nbsp;&nbsp;&nbsp<span class="tag"><span class="ad">ad</span></span></h4>
<div class="outline-text-4" id="text-3-1-12">
<ul class="org-ul">
<li>AS-REP Roasting (GetNPUsers.py)</li>
<li>Kerberoasting (GetUserSPNs.py)</li>
<li>Pass-the-Hash with Mimikatz (isolated lab)</li>
<li>BloodHound: visualize attack paths</li>
</ul>
<p>
<b>*</b> Combo: Full AD pentest chains into month project
</p>
</div>
</div>
<div id="outline-container-orgc5177c1" class="outline-4">
<h4 id="orgc5177c1"><span class="section-number-4">3.1.13.</span> <span class="todo TODO">TODO</span> [SCRPT-WK2] Build a C2 Beaconing Script (Lab Only)&nbsp;&nbsp;&nbsp<span class="tag"><span class="scripting">scripting</span>&nbsp;<span class="malware">malware</span></span></h4>
<div class="outline-text-4" id="text-3-1-13">
<ul class="org-ul">
<li>Python agent: beacon home every N seconds</li>
<li>Server: receive beacon, send back commands</li>
<li>Encode traffic in base64</li>
<li>Add jitter to beaconing interval</li>
</ul>
<p>
<b>*</b> NOTE: Lab/VM only. Learn detection via DEF-WK1.
</p>
</div>
</div>
<div id="outline-container-org2836306" class="outline-4">
<h4 id="org2836306"><span class="section-number-4">3.1.14.</span> <span class="todo TODO">TODO</span> [DEF-WK3] Set Up Suricata + Zeek IDS&nbsp;&nbsp;&nbsp<span class="tag"><span class="defense">defense</span>&nbsp;<span class="network">network</span></span></h4>
<div class="outline-text-4" id="text-3-1-14">
<ul class="org-ul">
<li>Install Suricata, load ET Open rules</li>
<li>Generate test alerts (nmap scan, exploit traffic)</li>
<li>Install Zeek, read conn.log and dns.log</li>
<li>Feed both into ELK (from DEF-WK1)</li>
</ul>
</div>
</div>
