public_html/articles/cybersec-projects.html
<div id="outline-container-org89bc353" class="outline-4">
<h4 id="org89bc353"><span class="section-number-4">3.1.15.</span> <span class="todo TODO">TODO</span> [WEB-WK3] Full Subdomain + Dir Recon Automation&nbsp;&nbsp;&nbsp<span class="tag"><span class="web">web</span>&nbsp;<span class="osint">osint</span>&nbsp;<span class="scripting">scripting</span></span></h4>
<div class="outline-text-4" id="text-3-1-15">
<ul class="org-ul">
<li>Chain: subfinder → httpx → ffuf → nuclei</li>
<li>Bash/Python pipeline: one command does all</li>
<li>Output: live subdomains, interesting endpoints, known CVE hits</li>
<li>Run against HackerOne bug bounty target</li>
</ul>
</div>
</div>
<div id="outline-container-org7dec79b" class="outline-4">
<h4 id="org7dec79b"><span class="section-number-4">3.1.16.</span> <span class="todo TODO">TODO</span> [CTF-WK1] Complete HackTheBox Starting Point (3 Machines)&nbsp;&nbsp;&nbsp<span class="tag"><span class="network">network</span>&nbsp;<span class="web">web</span></span></h4>
<div class="outline-text-4" id="text-3-1-16">
<ul class="org-ul">
<li>Tier 0–1 Starting Point machines</li>
<li>No walkthroughs until truly stuck (30 min rule)</li>
<li>Write report-style writeup for each</li>
<li>Focus: methodology, not just flags</li>
</ul>
</div>
</div>
<div id="outline-container-org39913ed" class="outline-4">
<h4 id="org39913ed"><span class="section-number-4">3.1.17.</span> <span class="todo TODO">TODO</span> [OSINT-WK1] OSINT Framework in Python&nbsp;&nbsp;&nbsp<span class="tag"><span class="osint">osint</span>&nbsp;<span class="scripting">scripting</span></span></h4>
<div class="outline-text-4" id="text-3-1-17">
<ul class="org-ul">
<li>Inputs: email, username, domain, IP</li>
<li>Lookups: WHOIS, DNS, breach check, social, Shodan</li>
<li>Output: markdown profile report</li>
<li>Add screenshot of profiles (selenium)</li>
</ul>
</div>
</div>
<div id="outline-container-orgc97f48b" class="outline-4">
<h4 id="orgc97f48b"><span class="section-number-4">3.1.18.</span> <span class="todo TODO">TODO</span> [NET-WK4] Metasploit Deep Dive&nbsp;&nbsp;&nbsp<span class="tag"><span class="network">network</span></span></h4>
<div class="outline-text-4" id="text-3-1-18">
<ul class="org-ul">
<li>Exploit VulnHub machine fully through Metasploit</li>
<li>Post-exploitation: hashdump, meterpreter, persistence</li>
<li>Pivoting with Metasploit route</li>
<li>Write custom resource script to automate</li>
</ul>
</div>
</div>
<div id="outline-container-org812eddc" class="outline-4">
<h4 id="org812eddc"><span class="section-number-4">3.1.19.</span> <span class="todo TODO">TODO</span> [CLOUD-WK1] AWS Misconfig &amp; Container Security Lab&nbsp;&nbsp;&nbsp<span class="tag"><span class="cloud">cloud</span></span></h4>
<div class="outline-text-4" id="text-3-1-19">
<ul class="org-ul">
<li>Deploy intentionally vulnerable app (Damn Vulnerable Cloud App)</li>
<li>Find: public S3, overprivileged IAM, exposed metadata</li>
<li>Docker escape: privileged container lab</li>
<li>Kubernetes: exposed dashboard, RBAC bypass</li>
</ul>
</div>
</div>
<div id="outline-container-org8b49627" class="outline-4">
<h4 id="org8b49627"><span class="section-number-4">3.1.20.</span> <span class="todo TODO">TODO</span> [CRYPT-WK2] Build a PKI from Scratch&nbsp;&nbsp;&nbsp<span class="tag"><span class="crypto">crypto</span>&nbsp;<span class="defense">defense</span></span></h4>
<div class="outline-text-4" id="text-3-1-20">
<ul class="org-ul">
<li>Create root CA with openssl</li>
<li>Issue intermediate CA, end-entity certs</li>
<li>Configure Apache/Nginx with custom cert</li>
<li>Implement CRL (certificate revocation list)</li>
</ul>
</div>
</div>
<div id="outline-container-org560529d" class="outline-4">
<h4 id="org560529d"><span class="section-number-4">3.1.21.</span> <span class="todo TODO">TODO</span> [MAL-WK3] YARA Rules — Write &amp; Test&nbsp;&nbsp;&nbsp<span class="tag"><span class="malware">malware</span>&nbsp;<span class="defense">defense</span></span></h4>
<div class="outline-text-4" id="text-3-1-21">
<ul class="org-ul">
<li>Learn YARA syntax</li>
<li>Write rules for 5 malware families from IOCs</li>
<li>Test against malware samples (MalwareBazaar)</li>
<li>Integrate YARA scan into Python script</li>
</ul>
</div>
</div>
<div id="outline-container-org1785c3f" class="outline-4">
<h4 id="org1785c3f"><span class="section-number-4">3.1.22.</span> <span class="todo TODO">TODO</span> [WEB-WK4] Android App Security Testing&nbsp;&nbsp;&nbsp<span class="tag"><span class="web">web</span>&nbsp;<span class="re">re</span></span></h4>
<div class="outline-text-4" id="text-3-1-22">
<ul class="org-ul">
<li>Decompile APK: jadx, apktool</li>
<li>Static: hardcoded keys, exported activities</li>
<li>Dynamic: MobSF, Frida hook</li>
<li>Intercept traffic with Burp on Android emulator</li>
</ul>
</div>
</div>
<div id="outline-container-org5dfd6f9" class="outline-4">
<h4 id="org5dfd6f9"><span class="section-number-4">3.1.23.</span> <span class="todo TODO">TODO</span> [DEF-WK4] Incident Response Lab&nbsp;&nbsp;&nbsp<span class="tag"><span class="defense">defense</span></span></h4>
<div class="outline-text-4" id="text-3-1-23">
<ul class="org-ul">
<li>Simulate: attacker compromises web server VM</li>
<li>IR process: detection → containment → eradication</li>
<li>Collect artifacts: memory dump (volatility), disk image</li>
<li>Write incident report</li>
</ul>
</div>
</div>
<div id="outline-container-org1432383" class="outline-4">
<h4 id="org1432383"><span class="section-number-4">3.1.24.</span> <span class="todo TODO">TODO</span> [NET-WK5] WPA2 PMKID Attack + Evil Twin AP&nbsp;&nbsp;&nbsp<span class="tag"><span class="network">network</span></span></h4>
<div class="outline-text-4" id="text-3-1-24">
<ul class="org-ul">
<li>PMKID attack with hcxdumptool (no client needed)</li>
<li>Set up evil twin with hostapd-wpe</li>
<li>Capture MSCHAPv2 credentials</li>
<li>Crack with hashcat mode 5500</li>
</ul>
<p>
<b>*</b> NOTE: Own network lab only.
</p>
</div>
</div>
<div id="outline-container-org53c7f97" class="outline-4">
<h4 id="org53c7f97"><span class="section-number-4">3.1.25.</span> <span class="todo TODO">TODO</span> [SCRPT-WK3] Vulnerability Scanner in Python&nbsp;&nbsp;&nbsp<span class="tag"><span class="scripting">scripting</span>&nbsp;<span class="network">network</span>&nbsp;<span class="web">web</span></span></h4>
<div class="outline-text-4" id="text-3-1-25">
<ul class="org-ul">
<li>Port scan → service detect → CVE lookup (NVD API)</li>
<li>Web: check SQLi, XSS, open redirect, headers</li>
<li>Output: severity-ranked HTML report</li>
<li>Diff reports: detect new vulns between scans</li>
</ul>
</div>
</div>
<div id="outline-container-orga7db4d3" class="outline-4">
<h4 id="orga7db4d3"><span class="section-number-4">3.1.26.</span> <span class="todo TODO">TODO</span> [OSINT-WK2] Threat Intel Aggregator&nbsp;&nbsp;&nbsp<span class="tag"><span class="osint">osint</span>&nbsp;<span class="defense">defense</span>&nbsp;<span class="scripting">scripting</span></span></h4>
<div class="outline-text-4" id="text-3-1-26">
<ul class="org-ul">
<li>Pull from: AlienVault OTX, AbuseIPDB, VirusTotal API</li>
<li>IOC lookup: IP, domain, hash</li>
<li>Feed matches into ELK SIEM alerts</li>
<li>Daily digest email report (smtplib)</li>
</ul>
</div>
</div>
