public_html/articles/cybersec-projects.html
<div id="outline-container-orgf68e9c1" class="outline-4">
<h4 id="orgf68e9c1"><span class="section-number-4">3.1.27.</span> <span class="todo TODO">TODO</span> [RE-WK1] Buffer Overflow 101&nbsp;&nbsp;&nbsp<span class="tag"><span class="re">re</span></span></h4>
<div class="outline-text-4" id="text-3-1-27">
<ul class="org-ul">
<li>Compile vulnerable C program (strcpy, no canary)</li>
<li>Find offset with pattern<sub>create</sub> (Metasploit)</li>
<li>Control EIP, redirect to shellcode</li>
<li>Bypass NX with ret2libc</li>
</ul>
</div>
</div>
<div id="outline-container-org163a283" class="outline-4">
<h4 id="org163a283"><span class="section-number-4">3.1.28.</span> <span class="todo TODO">TODO</span> [WEB-WK5] Build a Vulnerable Web App (for CTF)&nbsp;&nbsp;&nbsp<span class="tag"><span class="web">web</span>&nbsp;<span class="scripting">scripting</span></span></h4>
<div class="outline-text-4" id="text-3-1-28">
<ul class="org-ul">
<li>Flask app with intentional vulns: SQLi, XSS, IDOR, path traversal</li>
<li>Write challenge descriptions + flags</li>
<li>Host for friends or local CTF</li>
</ul>
<p>
<b>*</b> Combo: CTF hosting = teaches both attack &amp; defense mindset
</p>
</div>
</div>
<div id="outline-container-org4b8b07f" class="outline-4">
<h4 id="org4b8b07f"><span class="section-number-4">3.1.29.</span> <span class="todo TODO">TODO</span> [DEF-WK5] Zero Trust Network Lab&nbsp;&nbsp;&nbsp<span class="tag"><span class="defense">defense</span>&nbsp;<span class="network">network</span></span></h4>
<div class="outline-text-4" id="text-3-1-29">
<ul class="org-ul">
<li>Segment home lab into trust zones</li>
<li>WireGuard + firewall rules enforce zone boundaries</li>
<li>Service identity via mTLS (mutual TLS)</li>
<li>Verify: no lateral movement possible between zones</li>
</ul>
</div>
</div>
<div id="outline-container-orgf0fe357" class="outline-4">
<h4 id="orgf0fe357"><span class="section-number-4">3.1.30.</span> <span class="todo TODO">TODO</span> [NET-WK6] Analyze a Real-World CVE + Write PoC&nbsp;&nbsp;&nbsp<span class="tag"><span class="network">network</span>&nbsp;<span class="scripting">scripting</span></span></h4>
<div class="outline-text-4" id="text-3-1-30">
<ul class="org-ul">
<li>Pick recent CVE (Log4Shell, ProxyLogon class)</li>
<li>Read: NVD, GitHub advisory, patch diff</li>
<li>Set up vulnerable version in Docker</li>
<li>Write Python PoC or adapt existing one</li>
<li>Document: vuln class, impact, patch</li>
</ul>
</div>
</div>
<div id="outline-container-org98258ba" class="outline-4">
<h4 id="org98258ba"><span class="section-number-4">3.1.31.</span> <span class="todo TODO">TODO</span> [CLOUD-WK2] Serverless + API Security Testing&nbsp;&nbsp;&nbsp<span class="tag"><span class="cloud">cloud</span>&nbsp;<span class="web">web</span></span></h4>
<div class="outline-text-4" id="text-3-1-31">
<ul class="org-ul">
<li>Deploy Lambda function with IDOR vuln</li>
<li>Test: broken auth, over-privileged role, unvalidated input</li>
<li>API Gateway: enumerate endpoints, find undocumented</li>
<li>Use Postman + manual testing</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb727b9b" class="outline-3">
<h3 id="orgb727b9b"><span class="section-number-3">3.2.</span> ══════════════════════════════════════════</h3>
</div>
</div>
<div id="outline-container-org932e2fb" class="outline-2">
<h2 id="org932e2fb"><span class="section-number-2">4.</span> TIER 3 — MONTH PROJECTS (3–4 weeks each)</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org46952da" class="outline-3">
<h3 id="org46952da"><span class="section-number-3">4.1.</span> ══════════════════════════════════════════</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org784d1f3" class="outline-4">
<h4 id="org784d1f3"><span class="section-number-4">4.1.1.</span> <span class="todo TODO">TODO</span> [DEF-MO1] Build a Full Home SOC&nbsp;&nbsp;&nbsp<span class="tag"><span class="defense">defense</span>&nbsp;<span class="network">network</span></span></h4>
<div class="outline-text-4" id="text-4-1-1">
<ul class="org-ul">
<li>ELK Stack SIEM with real dashboards</li>
<li>Suricata + Zeek feeding into ELK</li>
<li>Cowrie honeypot logging live attacks</li>
<li>Wazuh or OSSEC host-based IDS on all VMs</li>
<li>PagerDuty/email alerts on critical events</li>
<li>Weekly threat digest auto-report</li>
</ul>
<p>
<b>*</b> Showcase: This alone is a real portfolio piece
</p>
</div>
</div>
<div id="outline-container-orge46852e" class="outline-4">
<h4 id="orge46852e"><span class="section-number-4">4.1.2.</span> <span class="todo TODO">TODO</span> [NET-MO1] OSCP-Style Multi-Machine Lab + Report&nbsp;&nbsp;&nbsp<span class="tag"><span class="network">network</span>&nbsp;<span class="web">web</span>&nbsp;<span class="re">re</span></span></h4>
<div class="outline-text-4" id="text-4-1-2">
<ul class="org-ul">
<li>Set up 5+ VulnHub/HackTheBox machines in lab</li>
<li>Full pentest each: recon → exploit → privesc → persist</li>
<li>Write a professional pentest report (executive summary + technical)</li>
<li>Include: scope, findings, risk ratings, remediation</li>
<li>Simulate: time-boxed (72h per machine)</li>
</ul>
<p>
<b>*</b> Showcase: Submit to eJPT or use as OSCP prep
</p>
</div>
</div>
<div id="outline-container-orge42fb70" class="outline-4">
<h4 id="orge42fb70"><span class="section-number-4">4.1.3.</span> <span class="todo TODO">TODO</span> [WEB-MO1] Full Web App Pentest Automation Suite&nbsp;&nbsp;&nbsp<span class="tag"><span class="web">web</span>&nbsp;<span class="scripting">scripting</span></span></h4>
<div class="outline-text-4" id="text-4-1-3">
<ul class="org-ul">
<li>Chain: subfinder → httpx → nuclei → custom SQLi/XSS scanner</li>
<li>Auto-screenshot interesting pages</li>
<li>Deduplicate + triage findings by severity</li>
<li>HTML report with evidence screenshots</li>
<li>Submit findings to HackerOne bug bounty</li>
</ul>
<p>
<b>*</b> Showcase: Use on real bug bounty targets (HackerOne/Bugcrowd)
</p>
</div>
</div>
<div id="outline-container-orga127a50" class="outline-4">
<h4 id="orga127a50"><span class="section-number-4">4.1.4.</span> <span class="todo TODO">TODO</span> [MAL-MO1] Full Malware Analysis Report on Real Sample&nbsp;&nbsp;&nbsp<span class="tag"><span class="malware">malware</span>&nbsp;<span class="re">re</span></span></h4>
<div class="outline-text-4" id="text-4-1-4">
<ul class="org-ul">
<li>Pick a notable open malware sample (emotet, njRAT)</li>
<li>Full static: PE analysis, string extraction, Ghidra decompile</li>
<li>Full dynamic: FlareVM, behavioral analysis</li>
<li>Extract all IOCs: IPs, domains, hashes, registry keys, mutexes</li>
<li>Write professional malware analysis report (15+ pages)</li>
<li>Publish on GitHub + LinkedIn</li>
</ul>
<p>
<b>*</b> Showcase: Top 1% of junior candidates have this
</p>
</div>
</div>
