public_html/articles/cybersec-projects.html
<div id="outline-container-org18b147c" class="outline-4">
<h4 id="org18b147c"><span class="section-number-4">4.1.5.</span> <span class="todo TODO">TODO</span> [AD-MO1] Active Directory Full Attack + Defense Lab&nbsp;&nbsp;&nbsp<span class="tag"><span class="ad">ad</span>&nbsp;<span class="network">network</span>&nbsp;<span class="defense">defense</span></span></h4>
<div class="outline-text-4" id="text-4-1-5">
<ul class="org-ul">
<li>Red: full AD attack chain (recon → foothold → lateral → DA)</li>
<li>AS-REP, Kerberoasting, DCSync, Golden Ticket</li>
<li>Blue: deploy Microsoft Defender for Identity, Sentinel</li>
<li>Detection rules for each attack technique (SIEM alerts)</li>
<li>Harden: tiering model, LAPS, privileged access workstations</li>
</ul>
<p>
<b>*</b> Showcase: Directly maps to enterprise pentest + SOC roles
</p>
</div>
</div>
<div id="outline-container-org326e5de" class="outline-4">
<h4 id="org326e5de"><span class="section-number-4">4.1.6.</span> <span class="todo TODO">TODO</span> [OSINT-MO1] Automated OSINT Platform&nbsp;&nbsp;&nbsp<span class="tag"><span class="osint">osint</span>&nbsp;<span class="scripting">scripting</span></span></h4>
<div class="outline-text-4" id="text-4-1-6">
<ul class="org-ul">
<li>Web UI (Flask/FastAPI + React) for OSINT investigations</li>
<li>Modules: person, domain, IP, company</li>
<li>Data sources: Shodan, HaveIBeenPwned, WHOIS, crt.sh, LinkedIn</li>
<li>Store results in SQLite, export PDF reports</li>
<li>Graph visualization of relationships (networkx + d3.js)</li>
</ul>
<p>
<b>*</b> Showcase: Open-source on GitHub — recruiter magnet
</p>
</div>
</div>
<div id="outline-container-org878c1dc" class="outline-4">
<h4 id="org878c1dc"><span class="section-number-4">4.1.7.</span> <span class="todo TODO">TODO</span> [CRYPT-MO1] Cryptography Attack Suite + PKI System&nbsp;&nbsp;&nbsp<span class="tag"><span class="crypto">crypto</span>&nbsp;<span class="scripting">scripting</span></span></h4>
<div class="outline-text-4" id="text-4-1-7">
<ul class="org-ul">
<li>Full PKI: root CA → intermediate → end-entity certs</li>
<li>Attack demonstrations: padding oracle, length extension, timing attack</li>
<li>Implement Diffie-Hellman, RSA, ECDSA from scratch in Python</li>
<li>Blog post explaining each attack with diagrams</li>
</ul>
<p>
<b>*</b> Showcase: Shows you understand crypto deeply, not just tools
</p>
</div>
</div>
<div id="outline-container-org3739566" class="outline-4">
<h4 id="org3739566"><span class="section-number-4">4.1.8.</span> <span class="todo TODO">TODO</span> [CLOUD-MO1] Cloud Security Audit + Hardening&nbsp;&nbsp;&nbsp<span class="tag"><span class="cloud">cloud</span>&nbsp;<span class="defense">defense</span></span></h4>
<div class="outline-text-4" id="text-4-1-8">
<ul class="org-ul">
<li>Full AWS audit: IAM, S3, EC2, Lambda, RDS</li>
<li>Find and document all misconfigurations (ScoutSuite report)</li>
<li>Remediate each finding + document steps</li>
<li>Implement: CloudTrail, GuardDuty, Config Rules, SCPs</li>
<li>Terraform IaC for hardened baseline deployment</li>
</ul>
<p>
<b>*</b> Showcase: AWS/GCP security skills are very hireable
</p>
</div>
</div>
<div id="outline-container-org2e86605" class="outline-4">
<h4 id="org2e86605"><span class="section-number-4">4.1.9.</span> <span class="todo TODO">TODO</span> [SCRPT-MO1] Full Pentest Automation Suite (CLI Tool)&nbsp;&nbsp;&nbsp<span class="tag"><span class="scripting">scripting</span>&nbsp;<span class="network">network</span>&nbsp;<span class="web">web</span></span></h4>
<div class="outline-text-4" id="text-4-1-9">
<ul class="org-ul">
<li>Modules: recon, web scan, vuln check, exploit assist, report gen</li>
<li>Plugin architecture — easy to extend</li>
<li>Config file support, rate limiting, scope enforcement</li>
<li>Full documentation, README, example output</li>
<li>Publish on GitHub, write a blog/Medium post</li>
</ul>
<p>
<b>*</b> Showcase: If this gets GitHub stars, it opens doors
</p>
</div>
</div>
<div id="outline-container-orgb486c0f" class="outline-4">
<h4 id="orgb486c0f"><span class="section-number-4">4.1.10.</span> <span class="todo TODO">TODO</span> [CTF-MO1] Host a Public CTF Competition&nbsp;&nbsp;&nbsp<span class="tag"><span class="web">web</span>&nbsp;<span class="network">network</span>&nbsp;<span class="crypto">crypto</span>&nbsp;<span class="re">re</span></span></h4>
<div class="outline-text-4" id="text-4-1-10">
<ul class="org-ul">
<li>Design 15–20 challenges across categories</li>
<li>Categories: web, crypto, forensics, RE, pwn, OSINT</li>
<li>Deploy CTFd platform (free)</li>
<li>Announce on Reddit/Discord, run for 48h</li>
<li>Write post-mortems + solution writeups after</li>
</ul>
<p>
<b>*</b> Showcase: Organizing = leadership. Recruiting loves this.
</p>
</div>
</div>
</div>
<div id="outline-container-orge2f02fa" class="outline-3">
<h3 id="orge2f02fa"><span class="section-number-3">4.2.</span> ══════════════════════════════════════════</h3>
</div>
</div>
<div id="outline-container-org501a00e" class="outline-2">
<h2 id="org501a00e"><span class="section-number-2">5.</span> CHAIN COMBO MAPS — SUGGESTED PATHS</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org220cc79" class="outline-3">
<h3 id="org220cc79"><span class="section-number-3">5.1.</span> ══════════════════════════════════════════</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org5b4727e" class="outline-4">
<h4 id="org5b4727e"><span class="section-number-4">5.1.1.</span> PATH A: Network Pentester (Offensive)</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Weekend → Week → Month
NET-W1 → NET-W2 → NET-W5 → RE-W1 →
NET-WK1 → NET-WK3 → NET-WK4 → AD-WK1 →
NET-MO1 (OSCP-style lab)
</p>
</div>
</div>
<div id="outline-container-org0cc9dab" class="outline-4">
<h4 id="org0cc9dab"><span class="section-number-4">5.1.2.</span> PATH B: Web/Bug Bounty Hunter</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
Weekend → Week → Month
WEB-W1 → WEB-W2 → WEB-W3 → WEB-W4 → WEB-W5 →
WEB-WK1 → WEB-WK2 → WEB-WK3 →
WEB-MO1 (pentest suite + bounty submission)
</p>
</div>
</div>
<div id="outline-container-orgc84e620" class="outline-4">
<h4 id="orgc84e620"><span class="section-number-4">5.1.3.</span> PATH C: Blue Team / SOC Analyst</h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
Weekend → Week → Month
DEF-W1 → DEF-W2 → DEF-W4 → MAL-W1 →
DEF-WK1 → DEF-WK2 → DEF-WK3 → DEF-WK4 →
DEF-MO1 (home SOC) → AD-MO1 (AD defense)
</p>
</div>
</div>
<div id="outline-container-org2575bdb" class="outline-4">
<h4 id="org2575bdb"><span class="section-number-4">5.1.4.</span> PATH D: Malware Analyst / Threat Intel</h4>
<div class="outline-text-4" id="text-5-1-4">
<p>
Weekend → Week → Month
MAL-W1 → MAL-W2 → RE-W2 →
MAL-WK1 → MAL-WK2 → MAL-WK3 → RE-WK1 →
MAL-MO1 (full malware analysis report)
</p>
</div>
</div>
<div id="outline-container-org0bcda22" class="outline-4">
<h4 id="org0bcda22"><span class="section-number-4">5.1.5.</span> PATH E: Security Engineer / Tool Builder</h4>
<div class="outline-text-4" id="text-5-1-5">
<p>
Weekend → Week → Month
SCRPT-W1 → SCRPT-W2 → SCRPT-W3 →
SCRPT-WK1 → SCRPT-WK2 → SCRPT-WK3 →
SCRPT-MO1 (pentest suite)
</p>
</div>
</div>
</div>
