public_html/articles/cybersec-projects.html
<div id="outline-container-org7011380" class="outline-3">
<h3 id="org7011380"><span class="section-number-3">5.2.</span> ══════════════════════════════</h3>
</div>
</div>
<div id="outline-container-orgceaa547" class="outline-2">
<h2 id="orgceaa547"><span class="section-number-2">6.</span> RESOURCES</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orge8e3121" class="outline-3">
<h3 id="orge8e3121"><span class="section-number-3">6.1.</span> ══════════════════════════════</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org222435d" class="outline-4">
<h4 id="org222435d"><span class="section-number-4">6.1.1.</span> Platforms And Websites</h4>
<div class="outline-text-4" id="text-6-1-1">
<ul class="org-ul">
<li>TryHackMe: <a href="https://tryhackme.com">https://tryhackme.com</a> (beginner friendly)</li>
<li>HackTheBox: <a href="https://hackthebox.com">https://hackthebox.com</a> (intermediate)</li>
<li>VulnHub: <a href="https://vulnhub.com">https://vulnhub.com</a> (free VMs)</li>
<li>picoCTF: <a href="https://picoctf.org">https://picoctf.org</a> (CTF practice)</li>
<li>HackerOne: <a href="https://hackerone.com">https://hackerone.com</a> (bug bounty)</li>
<li>MalwareBazaar: <a href="https://bazaar.abuse.ch">https://bazaar.abuse.ch</a></li>
<li>crackmes.one: <a href="https://crackmes.one">https://crackmes.one</a></li>
</ul>
</div>
</div>
<div id="outline-container-org191c2bd" class="outline-4">
<h4 id="org191c2bd"><span class="section-number-4">6.1.2.</span> Essential Tools</h4>
<div class="outline-text-4" id="text-6-1-2">
<ul class="org-ul">
<li>Kali Linux / ParrotOS</li>
<li>Burp Suite Community</li>
<li>Wireshark + tshark</li>
<li>Metasploit Framework</li>
<li>Ghidra (NSA, free)</li>
<li>BloodHound + SharpHound</li>
<li>Nuclei + ProjectDiscovery tools</li>
<li>Python 3 or Go (your best weapons)</li>
</ul>
</div>
</div>
<div id="outline-container-orgb78ded6" class="outline-4">
<h4 id="orgb78ded6"><span class="section-number-4">6.1.3.</span> Free Certifications to Stack</h4>
<div class="outline-text-4" id="text-6-1-3">
<ul class="org-ul">
<li>Google Cybersecurity Certificate (Coursera)</li>
<li>TryHackMe Jr Penetration Tester path</li>
<li>eJPT (INE, $200 — worth it after month projects)</li>
<li>CompTIA Security+ (entry-level industry standard)</li>
</ul>
</div>
</div>
<div id="outline-container-org8ae4dc9" class="outline-4">
<h4 id="org8ae4dc9"><span class="section-number-4">6.1.4.</span> Time Budget Suggestion</h4>
<div class="outline-text-4" id="text-6-1-4">
<pre class="example" id="orgd6e43f4">
   Month 1-2:  All Weekend projects (pick 2/weekend)
   Month 3-4:  Week projects (1 per week)
   Month 5-8:  Month projects (1 per month)
   Month 9+:   Bug bounty, certs, job apps
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-05-08 Fri 17:23</p>
<p class="author">Author: Connal McInnis</p>
<p class="date">Created: 2026-05-09 Sat 15:15</p>
</div>
</body>
</html>
